// ユーザーの選択結果を保存するresultsオブジェクトのデータ構造です。
results = {
  data: [
    {
      'サンプルカテゴリ1': 20
    },
    {
      'サンプルカテゴリ2': 17
    },
    {
      'サンプルカテゴリ3': 15
    },
    {
      'サンプルカテゴリ4': 13
    },
    {
      'サンプルカテゴリ5': 11
    },
    {
      'サンプルカテゴリ6': 11
    },
    {
      'サンプルカテゴリ7': 10
    },
    {
      'サンプルカテゴリ8': 5
    },
    {
      'サンプルカテゴリ9': 3
    },
    {
      'サンプルカテゴリ10': 2
    },
    {
      'サンプルカテゴリ11': 2
    },
    {
      'サンプルカテゴリ12': 0
    },
    {
      'サンプルカテゴリ13': 0
    },
    {
      'サンプルカテゴリ14': 0
    },
    {
      'サンプルカテゴリ15': 0
    },
    {
      'サンプルカテゴリ16': 0
    },
  ]
}